{
  "backend/main.mo": "Motoko actor managing user profiles, Fyers credentials, symbol lists, and status checks with access‑controlled operations stored per‑principal.",
  "feature_evidence.json": "Report describing a dashboard index‑performance feature and listing related frontend files, components, and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend components, pages, hooks, constants, and utilities.",
  "frontend/index.css": "Tailwind CSS base defining OKLCH theme variables for light and dark modes and applying global background and text colors.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top‑level React component handling theme setup, auth gating, profile modal, navigation, and routing between dashboard and settings.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity, handling sign‑in state, errors, cache clearing, and toast notifications.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save their name, using query hooks and form submission with validation and toasts.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper that blocks content until Internet Identity is loaded and signed in, showing a login card when unauthenticated.",
  "frontend/src/components/dashboard/IndexPerformanceSnapshot.tsx": "Card displaying sorted index performance data with percent change indicators, handling loading and error states.",
  "frontend/src/components/FyersConnectionForm.tsx": "React form for viewing connection status and saving or clearing Fyers API credentials with validation and toast feedback.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout with header, navigation, and user profile display, adapting for mobile and using Internet Identity state.",
  "frontend/src/components/results/OiMetricsCell.tsx": "Cell component showing OI change value with color coding and label, or a fallback when data is missing.",
  "frontend/src/components/results/QualificationBadge.tsx": "Badge rendering qualification status with corresponding colors and icons.",
  "frontend/src/components/results/ResultsTable.tsx": "Sortable table listing derivatives with status, candle metrics, and OI changes, supporting bull or bear sorting logic.",
  "frontend/src/components/SymbolUniverseEditor.tsx": "Editor for uploading, editing, counting, and saving per‑user symbol lists with file upload and validation.",
  "frontend/src/constants/scan.ts": "Defines the minimum scan interval constant set to 5000 ms.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useFyersConnection.ts": "Hooks for reading status and saving or clearing Fyers API credentials through the backend actor.",
  "frontend/src/hooks/useIndexPerformance.ts": "Hook fetching index performance data from the backend actor, refreshing periodically and handling missing methods.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch and update the current user's profile via the backend actor.",
  "frontend/src/hooks/useScanResults.ts": "Implements hooks to fetch scan results and timestamps and trigger new scans with cache invalidation.",
  "frontend/src/hooks/useSymbolUniverse.ts": "Provides hooks to fetch and save the symbol universe list through the backend actor.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, dark mode, and base styling rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard showing scan results, status indicators, and a scan trigger with various error and cooldown handling.",
  "frontend/src/pages/Settings.tsx": "Displays settings UI with tabs for configuring Fyers API credentials and managing the symbol universe.",
  "frontend/src/utils/derivativesViewModel.ts": "Contains helper functions for labeling derivative properties and deriving levels from candle data.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended colors, fonts, animations, and typography/container-query/animate plugins.",
  "project_state.json": "Defines project metadata and feature list for an Android app that analyzes F&O data, qualification rules, and dashboard metrics."
}